app/controllers/accounts_controller.rb

SELECT  "accounts".* FROM "accounts" WHERE "accounts"."username" = $1 LIMIT $2  [["username", "testuser"], ["LIMIT", 1]]
---
    def set_account
        @account = Account.find_by_username(params[:username])