app/controllers/posts_controller.rb

    def create
        @post = Post.new(post_params)
        @post.account_id = current_account.id if account_signed_in?

        if @post.save
---
INSERT INTO "posts" ("image", "active", "account_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["image", "Screenshot_from_2023-01-10_18-42-44.png"], ["active", true], ["account_id", 1], ["created_at", "2023-01-20 23:26:31.098515"], ["updated_at", "2023-01-20 23:26:31.098515"]]